<?php

$lang_admin_plugin_poll = array(

'Plugin title'          => '投票',
'Explanation 1'         => '该插件增加了投票选项。',
'Explanation 2'         => '您可以开启或关闭投票功能，并根据需要调整其他参数。',
'Form title'            => '选项',
'Show text button'      => '保存更改',
'Plugin redirect'       => '选项已更新。正在重定向 …',
'Legend1'               => '全局选项',
'Legend3'               => '其他选项',
'Q1'                    => '在此论坛中使用投票。',
'Q2'                    => '每个投票中问题的最大数量（建议一次设定）。',
'Q3'                    => '每个问题的最大答案数。（建议一次设定）',
'Q4'                    => '编辑投票的最大时间（单位：分钟）(值为0=时间无限制)',
'Q5'                    => '在可以通过“显示结果”按钮查看投票结果之前所需的最小投票数<br>（注意：默认值为1将隐藏用户在创建投票时更改此参数的选项）',
'Q6'                    => '允许访客查看投票结果。',

);
