<?php

// 在 register.php 中使用的语言定义
$lang_register = array(

// 其他
'No new regs'                => '本论坛目前不接受新用户注册。',
'Reg cancel redirect'       => '注册已取消。正在重定向 …',
'Forum rules'               => '论坛规则',
'Rules legend'              => '为了注册，您必须同意以下内容',
'Registration flood'        => '与您相同的IP地址的用户在最近一小时内已注册新用户。为了防止注册泛滥，同一IP地址之间注册至少需要间隔一小时。给您带来的不便请谅解。',
'Agree'                     => '同意',
'Cancel'                    => '取消',
'Register'                  => '注册',

// 表单验证（其中一些也在 post.php 中使用）
'Registration errors'       => '注册错误',
'Registration errors info'  => '在您注册之前，需要纠正以下错误：',
'Username censor'          => '您输入的用户名包含一个或多个被审查的词语。请选择一个不同的用户名。',
'Username dupe 1'           => '已有用户注册了用户名',
'Username dupe 2'           => '您输入的用户名太相似。用户名必须至少与现有用户名在一处字母或数字上不同。请选择一个不同的用户名。',
'Email not match'           => '电子邮件地址不匹配。',

// 注册电子邮件相关
'Reg email'                 => '感谢您的注册。您的密码已发送到指定的地址。如果没有收到，您可以联系论坛管理员。',
'Reg complete'              => '注册完成。正在登录并重定向 …',

// 注册信息
'Desc 1'                    => '注册将授予您访问许多原本不可用的特性和功能。这些功能包括编辑和删除帖子的能力，设计伴随您帖子的个人签名等。如果您对本论坛有任何疑问，您应该询问管理员。',
'Desc 2'                    => '下面是一个注册表单，您必须填写才能注册。一旦您注册成功，您应该访问您的个人资料，并查看您可以更改的不同设置。下面的字段只构成了您可以在个人资料中更改的所有设置的一小部分。',
'Username legend'           => '请输入一个2到25个字符长度的用户名',
'Pass legend'               => '请输入并确认您选择的密码',
'Pass info'                 => '密码至少需要9个字符长。密码是区分大小写的。',
'Email info'                => '您必须输入一个有效的电子邮件地址，因为您随机生成的密码将发送到该地址。',
'Confirm email'             => '确认电子邮件地址',

);
